const smallInfo = {
    "windmill": {
        "title": "Ветряные мельницы",
        "info": "Ветряные мельницы, которым более 4000 лет, по-видимому, использовались для улавливания восходящих потоков.",
        "img1": "https://i.pinimg.com/originals/52/09/47/5209477e1a0fa10623f18d59c890e37c.jpg",
        "img2": "https://static.wikia.nocookie.net/miabsfid/images/f/f8/Wind-Riding_Windmill.png",
    },
    "raiderOutpost": {
        "title": "Лагерь Искателей",
        "info": "Это наблюдательный лагерь, оснащённый большим телескопом, расположенный на глубине 2540 метров в Перевёрнутом лесу. Он расположен далеко от центра Бездны. Поскольку Проклятие Бездны здесь слабее, это место служит Искателям для отдыха и подготовки к спуску в 3й Слой.",
        "img1": "https://i.pinimg.com/1200x/d0/2b/0d/d02b0d7758d075841f36e632990ae6cf.jpg",
        "img2": "https://i.pinimg.com/736x/60/9c/31/609c31ece67546812525cc73b3f4f55c.jpg",
    },
    "ship": {
        "title": "Пиратский корабль",
        "info": "Древний пиратский корабль, погребённый в скале(3000 метров).",
        "img1": "https://static.wikia.nocookie.net/madeinabyss/images/f/f7/Ancient_pirate_ship_buried_in_the_cliff_face_of_the_Great_Fault_Anime.png",
        "img2": "img/pirate-ship.png",
    },
    "flowers": {
        "title": "Сад Цветов Стойкости",
        "info": "На высоте 9000 метров находится знаменитый Сад Цветов Стойкости, быстрорастущих многолетних растений, которые могут расти на любой почве, культовые цветы Бездны и официальные цветы города Орф.<p>Бесчисленные цветы создают неповторимую картину, благодаря которой сад стал одним из любимых мест в Бездне.</p>",
        "img1": "https://avatars.dzeninfra.ru/get-zen_doc/3855260/pub_5f7d1008f86257109271869f_5f7dd0a4b4802f1c4ad4e9bc/scale_1200",
        "img2": "https://static.wikia.nocookie.net/madeinabyss/images/9/9e/Garden_of_the_Flowers_of_Resilience_Anime.png",
    },
    "thing": {
        "title": "???",
        "info": "???",
        "img1": "https://static.wikia.nocookie.net/madeinabyss/images/6/6a/Scenery_in_the_second_Layer.jpg/revision/latest/scale-to-width-down/1000?cb=20200701233453",
        "img2": "https://static.wikia.nocookie.net/madeinabyss/images/6/6a/Scenery_in_the_second_Layer.jpg/revision/latest/scale-to-width-down/1000?cb=20200701233453",
    },
    "borders": {
        "title": "Деревня Ирубуру",
        "info": "Деревня Ирубуру, созданная Тремя мудрецами, где полностью отсутствует Силовое поле, как и (соответственно) Проклятие.",
        "img1": "img/IrumVillage.png",
        "img2": "https://i0.wp.com/blog-media-cloud.nyc3.digitaloceanspaces.com/2022/07/Made-in-Abyss-Retsujitsu-no-Ougonkyou-03.mkv_20220722124251_0032.png",
    }
}

const layersInfo = {
    "l0": {
        "name": "ДЕРЕВНЯ ОРФ",
        "depth": "",
        "info": "Орф состоит из пяти районов: Центрального, Северного, Западного, Южного и Восточного. В Западном районе города находится приют Бельчеро, в котором готовят юных искателей Бездны. Важно готовить искателя с юного возраста, чтобы тот мог приспособиться к проклятию Бездны. В Южном районе расположен литейный завод и припорто́вый округ трущоб. Последний был построен незаконными искателями и контрабандистами, разросшись таким образом, что часть зданий и пирс буквально свисают в Бездну.",
        "curseLvl": "0%",
        "curseInfo": "Силовое поле в городе отсутсвует, но Бездна всё ещё способна влять жителей города.",
        "curseImg": "https://64.media.tumblr.com/dc752760053f40face865b203c80fd86/9ee7a2e8c5d879ff-f3/s500x750/69697a26791eec58599988e9d491cda55b9c3b2c.gifv",
        "addInfo": ``,
        "enviromentInfo": "Несмотря на то, что Орф расположен в тропиках недалеко от линии экватора, он имеет доступ к прохладному воздуху, дующему из самой Бездны, поэтому там не жарко. Судя по легкой одежде, которую носят местные жители, в Округе Открытия на самом деле прохладный климат. Однако это не означает, что Орф и внешний мир полностью отрезаны один от другого. В прошлом бурные приливы приводили к тому, что только дирижабли могли добраться до этого места, но, с улучшением технологии мореплавания, корабли теперь путешествуют туда и обратно.",
        "resourcesInfo": "Реликвии из бездны приносят сюда и тут же их везут на продажу",
        "kanonEve": `Рико получает записку от матери Лайзы "Увидимся на дне Бездны". Это событие становится катализатором всего сюжета - Рико решает отправиться в опасное путешествие на дно Бездны`,
        "imagesLy": `
            <img src="https://avatars.mds.yandex.net/i?id=800c9348a5953e3d65fb023ac3ddbe2e_l-4518983-images-thumbs&n=13">
            <img src="https://i.pinimg.com/736x/7d/3f/f1/7d3ff11be5fe986d9b94c47d2231f24f.jpg">
            <img src="https://i.pinimg.com/736x/cb/4a/49/cb4a4964e919bc512bad6901855786f5.jpg"> 
        `
    },
    "l1": {
        "name": "СЛОЙ 1: КРАЙ БЕЗДНЫ",
        "depth": "Глубина: 0-1350м",
        "info": "1-й слой — это почти самый маленький участок Бездны, расположенный прямо под городом Орф. На глубине 50 метров находится система гондол Большого причала, которая спускается на 580 метров к Каменному ковчегу — скалистому выступу на высоте 600 метров.",
        "curseLvl": "3%",
        "curseInfo": "Легкое головокружение и тошнота при подъеме",
        "curseImg": "img/curses/1.png",
        "addInfo": `
            <div class="info-section">
                <h3>⚰️ Погребальная башня</h3>
                <p>На глубине 300 метров расположена уникальная Погребальная башня, где сотни скелетов возрастом около 2000 лет лежат со сложенными в молитве руками.</p>
            </div>
        `,
        "enviromentInfo": "Окружающая среда практически не меняется, а дикая природа состоит в основном из безвредных животных. Однако иногда хищники из 2-го или 3-го слоёв поднимаются сюда в поисках пищи.",
        "resourcesInfo": "Здесь не так много сокровищ и Артефактов, но встречается значительное количество Молящихся скелетов. Из-за умеренного уровня опасности неопытные искатели (Красные свистки) часто начинают свои поиски именно здесь",
        "kanonEve": "Именно в этом слое Рико нашла Рэга без сознания после того, как он использовал Испепелитель, чтобы спасти её от Алого аспида.",
        "imagesLy": `
            <img src="https://avatars.mds.yandex.net/i?id=fc1a0b09e111fd734433624047972f7f_l-5280087-images-thumbs&n=13">
            <img src="https://avatars.mds.yandex.net/i?id=3632c000d2ba9a75a2c582e261b4e541_l-6263806-images-thumbs&n=13">
            <img src="https://i.ytimg.com/vi/3OwjZaXjVRg/maxresdefault.jpg"> 
        `
    },
    "l2": {
        "name": "СЛОЙ 2: ЛЕС ИСКУШЕНИЯ",
        "depth": "Глубина: 1350-2600м",
        "info": "Первый по-настоящему опасный участок Бездны. Фауна и окружающая среда резко меняются, превращаясь в тропический лес с гигантской растительностью. Он полон опасных существ, а подъем становится все труднее, что делает его доступным только для опытных искателей. Если обладатель Красного свистка каким-то образом попадает на 2-й слой, это расценивается как самоубийство, и спасательную группу ему не отправляют.",
        "curseLvl": "20%",
        "curseInfo": "Здесь эффект проклятия проявляется в виде сильной тошноты, головной боли и онемения конечностей.",
        "curseImg": "img/curses/2.png",
        "addInfo": `
            <div class="info-section">
                <h3>🌳 Перевёрнутый лес</h3>
                <p>Глубже в этом слое находится область, известная как «Перевёрнутый лес». Здесь восходящие потоки и воздушные течения, исходящие из Бездны, настолько сильны, что окружающая среда фактически переворачивается, создавая лабиринт из перевёрнутых платформ, между которыми приходится перепрыгивать — даже вода течёт вверх. Силовое поле Бездны, являющееся причиной проклятия, здесь слабее по сравнению с другими областями 2-го слоя. Вследствие этого атмосфера становится темнее и холоднее.</p>
            </div>
            <div class="info-section">
                <h3>🦠 Вирус 2-го слоя</h3>
                <p>В этом слое обитает неизвестный вирус, вызывающий тахионную болезнь. Искатели, получившие ранг Синего свистка и выше, принимают вакцину для защиты от этой угрозы.</p>
            </div>
        `,
        "enviromentInfo": "Верхнюю половину слоя покрывает лес из массивных растений, напоминающих лепестки лилий. Эта флора обеспечивает хорошее укрытие от потенциальных угроз, однако она также затрудняет обзор местности, усложняя ориентирование. К счастью, листья всегда направлены к центру Бездны. Учитывая это, а также тот факт, что на их стеблях растет Амагири, заблудившиеся могут относительно легко найти дорогу.",
        "resourcesInfo": `Примерно 40 % обнаруженных здесь реликвий имеют яйцевидную форму.`,
        "kanonEve": "Рико и Рег встречают легендарный Белый Свисток Озен Непоколебимую. Та подвергает их жестоким испытаниям на выживание, проверяя решимость дуэта. И передает им послание от Лайзы, подтверждая, что та скорее всего действительно жива в глубинах Бездны. Это поворотный момент, где герои осознают истинную цену своего путешествия.",
        "imagesLy": `
            <img src="https://dve-images.imggaming.com/original/p/2023/12/20/ee7XZ4t73yjcQCmuEMC5XhQhrjj9ub1l-1703097584302.jpg">
            <img src="https://avatars.mds.yandex.net/i?id=db1e467567625b6e73db984d44c23be3d29d2317-9229079-images-thumbs&n=13">
            <img src="https://avatars.mds.yandex.net/i?id=488869761d8df5d11731f6e19e54c48a_l-3723805-images-thumbs&n=13"> 
        `
    },
    "l3": {
        "name": "СЛОЙ 3: ВЕЛИКИЙ РАЗЛОМ",
        "depth": "Глубина: 2 600-7 000м",
        "info": "Третий слой представляет собой вертикальный спуск, простирающийся на 4000 метров вниз ввиде круглой шахты. Единственный возможный способ пересечь её — через сеть пещер, логов и нор. Они, вероятно, были сделаны как естественным путем, так и искателями, древними людьми и плоскогрызами, которые живут в них. Центральная шахта этого уровня значительно уже в диаметре, чем другие слои Бездны, о чём свидетельствует Карта Бездны.",
        "curseLvl": "30%",
        "curseInfo": "Здесь, помимо таких эффектов с предыдущих слоев, как головокружение и тошнота, Проклятие также вызывает зрительные и слуховые галлюцинации.",
        "curseImg": "img/curses/2.png",
        "addInfo": `
            <div class="info-section">
                <h3>🥚 Шипастые яйца</h3>
                <p>На отметке 6 750 метров в центральной шахте есть много шипастых яиц, закрепившихся вдоль стен. Из яиц вылупляются кальмары Казура, которые плавают в самых высоких кубках на четвертом уровне.</p>
            </div>
            <div class="info-section">
                <h3>🎗 Интересный факт</h3>
                <p>На 3-ем слое и ниже свет, идущий снизу, на самом деле сильнее солнечного света снаружи.</p>
            </div>
        `,
        "enviromentInfo": "Этот слой является домом для крупных воздушных хищников, таких как Мадокаджек или Алый аспид, которые также известны тем, что используют свою грубую силу, чтобы проникнуть в боковые пещеры и захватить свою добычу. Пузоглоты также находятся в пещерных системах и могут представлять угрозу для искателей. Однако их основным источником пропитания являются плоскогрызы, и они не ведут активную охоту на людей. В то время как внутренние пещеры в основном являются домом для неагрессивных существ, иногда в более крупных пещерах гнездятся Мадокаджеки.",
        "resourcesInfo": "Здесь могут встретится такие артифакты, как Нежный стук и Солнечная сфера 3-го уровня.",
        "kanonEve": "Рико и Рег встречают того самого Алого Аспида, которого Рег когда-то подстрелил, спасая Рико.",
        "imagesLy": `
            <img src="https://ic.pics.livejournal.com/rotten_k/28560669/8777288/8777288_original.jpg">
            <img src="https://avatars.dzeninfra.ru/get-zen_doc/3866587/pub_634cf1413948ac1658ab5378_634cf1483948ac1658ab57bc/scale_1200">
            <img src="https://i.ytimg.com/vi/o40RlDXAWs4/maxresdefault.jpg">
            <img src="https://i.pinimg.com/736x/50/31/5b/50315b7e978a9ae518c1906bbf0742b8.jpg"> 
        `
    },
    "l4": {
        "name": "СЛОЙ 4: КУБКИ ВЕЛИКАНОВ",
        "depth": "Глубина: 7 000-12 000 м",
        "info": `Это влажные джунгли крепких лиан и переплетающихся гигантских вогнутых дисков, называемых "Плоская лиана". Диски захватывают конденсирующуюся воду из воздуха, создавая неглубокие бассейны. Многие существа, такие как Шарокол, живут в этих бассейнах. Высокая концентрация теплой воды в этом регионе создает среду с высокой влажностью, что иногда вызывает туман. Кроме того, свет от Силового поля преломляется, отражаясь от воды, придавая пейзажу 4-го слоя голубой оттенок.`,
        "curseLvl": "50%",
        "curseInfo": "Эффект Проклятия при подъёме с данного уровня: сильные боли по всему телу и кровотечение из всех отверстий.",
        "curseImg": "img/curses/3.png",
        "addInfo": `
            <div class="info-section">
                <h3>🥣 Кубки Великанов</h3>
                <p>Каждые две тысячи лет механизмы ловли добычи Плоской лианы, т.е. их "кубок", увядают, оставляя землю под ними открытой для света. Не имея препятствий, растения находящиеся под ними соревнуются за то, чтобы вырасти как можно выше и больше, создавая совершенно новый ландшафт. Поскольку окружающая среда постоянно меняется, не было предпринято никаких попыток создать подробную карту местности, за исключением фиксированных ориентиров.</p>
            </div>
            <div class="info-section">
                <h3>🏠 Убежище Наначи</h3>
                <p>В отдаленной местности, вдали от центральной шахты, в верхней области 4-го слоя находится Убежище Наначи. Из-за своей удалённости от центральной шахты он практически не затрагивается Проклятием.</p>
            </div>
        `,
        "enviromentInfo": "Среда Бездны населена уникальными существами и растениями, адаптированными к её суровым условиям. Среди обитателей встречаются хищные Рыбы-демоны и Кальмары Казура, причудливые Грибные медведи и Молотоклювы, а также Шароколы. С глубины распространяются Неувядающие притворщики, маскирующиеся под окружение. Растительный мир представлен мистическим Цветком вечной удачи, цепкими Плоскими лианами, разнообразными грибами вроде Гинтоко и Водяного гриба, а также обманчивой Жёлтой блестящей травой и древними Дзуцууги. Многие виды остаются неизученными, образуя хрупкую экосистему, где выживание зависит от взаимной адаптации к аномалиям Бездны.",
        "resourcesInfo": "Здесь могут встретится такие артифакты, как Пламекос (найден на пустой могиле), Тканный туман, Беззвучный колокол, Солнечная сфера 4-го уровня.",
        "kanonEve": "Здесь герои подверглись серьёзной опасности, встретя Шаракола, он был первым существом с которым не смог справится Рег, в результате чего Рико получила смертельную дозу яда Шарокола, дабы спасти Рико, Регу пришлось поднятся с ней на более высокую точку, тем самым подвергнув свою подругу ещё и проклятию бездны. К счастью Рико удалось выжить, посколько вовремя появилась Пустая Наначи",
        "imagesLy": `
            <img src="https://i.pinimg.com/originals/d5/b8/bd/d5b8bdcf3b8e04db2d52725be1d2180d.png">
            <img src="https://i.ytimg.com/vi/zUgSL6Kr3EQ/maxresdefault.jpg">
            <img src="https://i.pinimg.com/originals/cf/e6/1b/cfe61b5fbabb9d32f3b6151c7c915be1.png">
            <img src="https://shikimori.one/system/user_images_h/original/9a084a497c8a3e99c3edb6d9/10aa3102fe77360fa9aa5b791ff0aebdfa000df23fbc89f488528724bafba844.jpg"> 
        `
    },
    "l5": {
        "name": "СЛОЙ 5: МОРЕ МЕРТВЕЦОВ",
        "depth": "Глубина: 12 000-13 000 метровм",
        "info": "Пятый слой — это мир, в который попадают только искатели-носители Белого или Черного свистка и, по словам Шигги, количество людей, успешно вернувшихся живыми, можно сосчитать по пальцам одной руки. По вертикали это самый короткий слой Бездны, его глубина составляет всего 1 000 метров, но он также самый широкий по горизонтали, по оценкам, в десятки раз больше Орфа. Наиболее заметная физическая особенность этого слоя — большое море, населенное первобытными существами и усеянное костями, отсюда и название «Море трупов».",
        "curseLvl": "60%",
        "curseInfo": "В этом слое Проклятие принимает форму крайней сенсорной депривации, сначала лишая человека основных чувств. Примером тому служит случай, когда Рико сама не заметила, что упала с лестницы. Затем Проклятие быстро перерастает в потерю самоощущения (в медицине это называется проприоцепцией). Подобная депривация также делает крайне вероятным непреднамеренное причинение вреда себе, как это было замечено, когда Рико сжала челюсть так сильно, что сломала собственные зубы, не осознавая причиненного вреда, пока не засунула палец в рот и не увидела кровь.",
        "curseImg": "https://static.wikia.nocookie.net/madeinabyss/images/2/25/Riko_L5_Curse_Anime.png",
        "addInfo": `
            <div class="info-section">
                <h3>⚙ Идофронт</h3>
                <p>На глубине 13 000 метров, самой глубокой точке над водой, Белым свистком Бондрюдом была основана передовая оперативная база под названием Идофронт. Первоначально на месте Идофронта находились руины бывшего ритуального места. Источником электроэнергии для Идофронта служит вращение неудержимого водоворота, на котором он построен. В его центре, Алтаре абсолютной границы, находится устройство, похожее на лифт, которое используется для перемещения людей через море в 6-й слой. Однако активировать его можно только с помощью Белого свистка, а точнее, камня, отражающего жизнь. Поскольку отражающие жизнь камни специально созданы для использования только их владельцами, лифт доступен только тем, у кого есть свой Белый свисток.</p>
            </div>
        `,
        "enviromentInfo": "Под обычной водой находится слой густой, слизистой жидкости, подвешивающей море на месте. В центральной точке моря находится большой водопад, обеспечивающий доступ почтовым шарам для подъема снизу. По всему морю разбросаны большие структуры, образованные из кристаллизованной воды, известные путешественникам как «иней» Сами структуры называются либо «водяным барьером», либо «водяными укреплениями», последние являются постоянными образованиями, которые удерживаются Силовым полем.",
        "resourcesInfo": "Здесь могут встретится такие артифакты, как Алтарь абсолютной границы, Твоя ценность, Спарагмос, Зоаголик.",
        "kanonEve": "Именно на этом слое Наначи и Митти стали пустыми. А Рег потерял свою правую руку и вспомнил как управлять своим телом. Также Рико получает свой резонатор жизни(будующий белый свисток).",
        "imagesLy": `
            <img src="https://static1.cbrimages.com/wordpress/wp-content/uploads/2022/01/Made-in-Abyss-5th-layer.jpg">
            <img src="https://i.ytimg.com/vi/KLqOHzWJQxE/maxresdefault.jpg">
            <img src="https://images.kinorium.com/movie/shot/2155987/w1500_49455122.jpg"> 
        `
    },
    "l6": {
        "name": "СЛОЙ 6: СТОЛИЦА НЕВОЗВРАТА",
        "depth": "Глубина: 13 000 — 15 000м",
        "info": "В Столице невернувшихся нетронутыми спят руины величественного города. В Орфе ходят слухи о золотом городе, спящем на дне Бездны, который, как говорят, возник из этого самого города в 6-м слое. Сам город описывается как золотой — однако руины покрыты кристаллическим материалом. Неясно, были ли здания специально сделаны из этого кристалла или же они окаменели со временем. Сами руины разбросаны во все стороны, и часто здания расположены по диагонали, вверх ногами или боком. Часто встречаются звери — от абсурдных до необычайно опасных, а также случайные яркие геотермальные взрывы, испускающие ядовитый газ. Отпугиватель птиц, используемый на почтовых шарах, не действует на пернатых в 6-м слое.",
        "curseLvl": "85%",
        "curseInfo": "Здесь проклятие причиняет невообразимую боль и заставляет жертву мутировать, превращаясь в бездумную груду плоти, при этом интеллект и сознание исчезают, оставляя лишь базовые инстинкты. Проклятие также может привести к смерти, что, пожалуй, является более милосердным исходом. Однако при определенных обстоятельствах люди могут мутировать в пустышку, как Наначи, сохранив свой разум.",
        "curseImg": "img/curses/4.png",
        "addInfo": `
        `,
        "enviromentInfo": "Среда 6го слоя населена уникальными существами и растениями, демонстрирующими невероятную адаптацию к её опасным условиям. Среди обитателей встречаются загадочные Дети Ирумьюй, скрытные Крысы-отшельники и хищные Мидзаджеки. Особую опасность представляют Куонгатари с их прочными нитями-ловушками и агрессивные Серпороги. Флора включает выносливый Цветок стойкости и таинственные Сайнона, способные выживать в экстремальных условиях. Многие виды, такие как Псевдовода и Пустышки, обладают мимикрическими способностями, а некоторые, подобно Рюусазай, остаются малоизученными. Эта хрупкая экосистема демонстрирует удивительное разнообразие жизни, сформировавшейся под воздействием проклятия 6го уровня.",
        "resourcesInfo": "Здесь могут встретится такие артифакты, как Алтарь последнего погружения, Колыбель желания, Складной горшок, Нежный стук, Выдох русалки, Твёрдое мыло, Психокинетическая рука.",
        "kanonEve": "Здесь главная (уже) тройца, впервые встречают Фапуту, принцесса пустых, именно с ней происходит события разворачивающиеся на 6ом слое в момент путешествия Рико.",
        "imagesLy": `
            <img src="https://i.ytimg.com/vi/vE1FKzrIl08/maxresdefault.jpg">
            <img src="https://www.leisurebyte.com/wp-content/uploads/2022/07/Screenshot-6376.jpg">
            <img src="https://pic.rutubelist.ru/video/9d/74/9d7469a123df6eadbaf9e175d1db32ed.jpg">
        `
    },
    "l7": {
        "name": "СЛОЙ 7: ПРОЩАЛЬНАЯ ПУЧИНА",
        "depth": "Глубина: 15 500 — ???м",
        "info": "Из поколения в поколение носители Белого свистка передают друг другу тайны об этом слое из уст в уста. Ходят слухи о таинственном кольце, «Кольце сущности», свидетелей которого можно пересчитать на пальцах, и легенды о существовании таинственных существ, называемых «привратниками», на пути к дну Бездны. У порога между шестым и седьмым слоями находится ориентир, который Сраджо называет «оком».",
        "curseLvl": "90%",
        "curseInfo": "По словам Сраджо, существует только один задокументированный случай проклятия седьмого слоя. Он был найден в запечатанном письме в первом слое 250 лет назад. Таким образом, истинная природа проклятия седьмого слоя неизвестна, однако незнающие жители города Орф говорят, что это неминуемая гибель.",
        "curseImg": "img/curses/5.png",
        "addInfo": `
            <div class="info-section">
                <h3>🌌 Неизвестные потоки</h3>
                <p>В этом слое можно увидеть потоки неизвестного газообразного вещества с экстремально низкими температурами и осадками, проходящие вдоль полос Силового поля.</p>
            </div>
        `,
        "enviromentInfo": "???",
        "resourcesInfo": "???",
        "kanonEve": "Фапута смогла пообщаться с душой внутри свистка Лайзы, Дони, и подтвердить существование в этом слое «Кольца сущности» и неизвестного существа, связанного с Рэгом.",
        "imagesLy": `
            <img src="https://i.ytimg.com/vi/xYL97w993vo/maxresdefault.jpg">
            <img src="https://i.ytimg.com/vi/2_DQVE_IPUM/maxresdefault.jpg"> 
        `
    },
    "l8": {
        "name": "СЛОЙ 8: ГЛУБОЧАЙШАЯ ТОЧКА(предположительно)",
        "depth": "Глубина: ???-???м",
        "info": "Об дне бездны ничего не известно",
        "curseLvl": "100%",
        "curseInfo": "???",
        "curseImg": "img/curses/6.png",
        "addInfo": `
        `,
        "enviromentInfo": "???",
        "resourcesInfo": "???",
        "kanonEve": "На данный момент герои ещё не добрались до 8го слоя",
        "imagesLy": `
        `
    }
}

const modal = document.querySelector('.modal-lyBody');
const lyDia = document.querySelector('.dialog-bg');

lyDia.addEventListener("click", function() {
    lyDia.style.display = "none"
})

document.addEventListener("DOMContentLoaded", function() {
    const layers = document.querySelectorAll('.layer')
    layers.forEach(layer => {
        layer.addEventListener("click", function() {
            lyDia.innerHTML = `
                <div class="dialog-layers">
                    <div class="layer-header">
                        <h2>${layersInfo[layer.id].name}</h2>
                        <div class="depth">${layersInfo[layer.id].depth}</div>
                    </div>
                    <div class="layer-content">
                        <div class="layer-mainInfo">
                            <div class="info-section">
                                <h3>📍 Основаня информация</h3>
                                <p>${layersInfo[layer.id].info}</p>
                            </div>
                            <div class="info-section">
                                <div style="display: grid;
                                            grid-template-columns: 1fr auto;
                                            height: 100%;">
                                    <div>
                                        <h3>⚡ Проклятие</h3>
                                        <div class="curse-bar">
                                                <div class="curse-fill" style="width: ${layersInfo[layer.id].curseLvl}"></div>
                                        </div>
                                        <p>${layersInfo[layer.id].curseInfo}</p>
                                    </div>
                                        <img src="${layersInfo[layer.id].curseImg}" 
                                        style="height: 10vw;
                                               width: 10vw;
                                               border-radius: 100%;">
                                </div>
                            </div>
                            ${layersInfo[layer.id].addInfo}
                        
                            <div class="info-section">
                                <h3>🌿 Среда и обитатели</h3>
                                <p>${layersInfo[layer.id].enviromentInfo}</p>
                            </div>
                        
                            <div class="info-section">
                                <h3>💎 Ресурсы и исследования</h3>
                                <p>${layersInfo[layer.id].resourcesInfo}</p>
                            </div>
                        
                            <div class="info-section highlight">
                                <h3>🌟 Ключевое событие</h3>
                                <p>${layersInfo[layer.id].kanonEve}</p>
                            </div>
                        </div>
                        <div class="layer-mainInfo">
                            ${layersInfo[layer.id].imagesLy}    
                        </div>
                    </div>
                </div>
                `
            lyDia.style.display = "flex"
        })
        // layer.addEventListener("mouseleave", function() {
        //     layer.style.opacity = "0";
        //     layer.style.transition = "all 0.1s ease-out";
        // })
    });
})

const lyMap = document.querySelector(".layers-conatiner")

lyMap.addEventListener('mousemove', function(e) {
    if (modal) {
        modal.style.left = (e.clientX - modal.offsetWidth - 20) + 'px';
        modal.style.top = e.pageY + 'px';
    }
});

document.addEventListener("DOMContentLoaded", function() {
    const maps = document.querySelectorAll('.circleMap')
    maps.forEach(map => {
        map.addEventListener("mouseenter", function() {
            modal.innerHTML = `
                <div class="image-modal-area">
                    <p><img src="${smallInfo[map.id].img1}"></p>
                    <p><img src="${smallInfo[map.id].img2}"></p>
                </div>
                <div class="text-modal-area"> 
                    <div class="text-modal-title">${smallInfo[map.id].title}</div>
                    ${smallInfo[map.id].info}
                </div>
                `
            modal.style.display = "grid"
        })
        map.addEventListener("mouseleave", function() {
            modal.style.display = "none"
        })
    });
})